Public Member Functions | Public Attributes | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
ACAPI::MEP::v1::RoutingElementDefault Class Reference
MEP Element Manager
The RoutingElementDefault contains the necessary non-geometric data for creating a Routing element. More...
#include <MEPRoutingElementDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::RoutingElementDefault:
 Public Member Functions
RoutingSegmentDefault  | GetRoutingSegmentDefault () const
RoutingNodeDefault  | GetRoutingNodeDefault () const
Domain  | GetDomain () const
Retrieves the domain of the RoutingElementDefault.
API_AttributeIndex  | GetMEPSystem () const
Returns the MEPSystem attribute of the RoutingElementDefault.
Result< UniqueID >  | Place (const std::vector< API_Coord3D > &nodeCoordinates, const std::vector< RoutingSegmentCrossSectionData > &crossSectionData, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places a Routing element based on the Default.
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
void  | SetRoutingSegmentDefault (const RoutingSegmentDefault &routingSegmentDefault)
Sets the RoutingSegmentDefault of RoutingElement.
void  | SetRoutingNodeDefault (const RoutingNodeDefault &routingNodeDefault)
Sets the RoutingNodeDefault of RoutingElement.
Result< void >  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of RoutingElement.
 Public Attributes
friend  | RoutingElementDefault
 Protected Member Functions
RoutingElementDefault (std::shared_ptr< Impl::IRoutingElementDefaultImpl >)
 Static Protected Member Functions
static Result< RoutingElementDefault >  | Create (const API_Token &, Domain)
 Friends
class  | RoutingElement
Result< RoutingElementDefault >  | CreateRoutingElementDefault (Domain)
Creates a RoutingElementDefault.
Detailed Description
The RoutingElementDefault contains the necessary non-geometric data for creating a Routing element.
Since
Archicad 27
Example code snippet from Test / New MEP
Pickup and Getters
 // Write Defaults
 RoutingElementDefault routingElementDefault = routingElement->PickUpDefault ();
 // Default Routing Segment
 routingElementReporter.AddNewLine ();
 routingElementReporter.Add ("Default Routing Segment:");
 routingElementReporter.SetTabCount (1);
 RoutingSegmentDefault routingSegmentDefault = routingElementDefault.GetRoutingSegmentDefault ();
 routingElementReporter.Add ("Cross Section Width", routingSegmentDefault.GetCrossSectionWidth ());
 routingElementReporter.Add ("Cross Section Height", routingSegmentDefault.GetCrossSectionHeight ());
 routingElementReporter.Add ("Cross Section Shape", routingSegmentDefault.GetCrossSectionShape ());
 routingElementReporter.Add ("Table of dimensions ID", routingSegmentDefault.GetPreferenceTableId ());
 routingElementReporter.AddNewLine ();
 routingElementReporter.Add ("Default Rigid Segment:");
 routingElementReporter.SetTabCount (2);
 RigidSegmentDefault rigidSegmentDefault = routingSegmentDefault.GetRigidSegmentDefault ();
 routingElementReporter.Add ("Width", rigidSegmentDefault.GetWidth ());
 routingElementReporter.Add ("Height", rigidSegmentDefault.GetHeight ());
 routingElementReporter.Add ("Shape", rigidSegmentDefault.GetShape ());
 // Default Routing Node
 routingElementReporter.SetTabCount (0);
 routingElementReporter.AddNewLine ();
 routingElementReporter.Add ("Default Routing Node:");
 routingElementReporter.SetTabCount (1);
 RoutingNodeDefault routingNodeDefault = routingElementDefault.GetRoutingNodeDefault ();
 routingElementReporter.Add ("Preferred Transition Placement", routingNodeDefault.GetPreferredTransitionPlacement ());
 routingElementReporter.AddNewLine ();
 routingElementReporter.Add ("Default Bend:");
 routingElementReporter.SetTabCount (2);
 BendDefault bendDefault = routingNodeDefault.GetBendDefault ();
 routingElementReporter.Add ("Factor Radius", bendDefault.GetFactorRadius ());
 routingElementReporter.SetTabCount (1);
 routingElementReporter.AddNewLine ();
 routingElementReporter.Add ("Default Transition:");
 routingElementReporter.SetTabCount (2);
 TransitionDefault transitionDefault = routingNodeDefault.GetTransitionDefault ();
 routingElementReporter.Add ("Angle", transitionDefault.GetAngle ());
 routingElementReporter.Add ("Offset Y", transitionDefault.GetOffsetY ());
 routingElementReporter.Add ("Offset Z", transitionDefault.GetOffsetZ ());
 routingElementReporter.Write ();
 Assemble placement data
 std::vector<API_Coord3D> referenceCoords1;
 referenceCoords1.push_back ({ 0.0, 0.0, 2.0 });
 referenceCoords1.push_back ({ 5.0, 0.0, 2.0 });
 referenceCoords1.push_back ({ 5.0, 5.0, 2.0 });
 referenceCoords1.push_back ({ 10.0, 5.0, 2.0 });
 referenceCoords1.push_back ({ 10.0, 10.0, 2.0 });
 std::vector<RoutingSegmentCrossSectionData> crossSectionData1;
 crossSectionData1.push_back ({ 0.025, 0.025, ConnectorShape::Circular });
 crossSectionData1.push_back ({ 0.025, 0.025, ConnectorShape::Circular });
 crossSectionData1.push_back ({ 0.025, 0.025, ConnectorShape::Circular });
 crossSectionData1.push_back ({ 0.025, 0.025, ConnectorShape::Circular });
 std::vector<API_Coord3D> referenceCoords2;
 referenceCoords2.push_back ({ 10.0, 10.0, 2.0 });
 referenceCoords2.push_back ({ 15.0, 10.0, 2.0 });
 referenceCoords2.push_back ({ 15.0, 15.0, 2.0 });
 std::vector<RoutingSegmentCrossSectionData> crossSectionData2;
 crossSectionData2.push_back ({ 0.02, 0.02, ConnectorShape::Circular });
 crossSectionData2.push_back ({ 0.02, 0.02, ConnectorShape::Circular });
 return PlaceRoutesAndConnect ({ { referenceCoords1, crossSectionData1 }, { referenceCoords2, crossSectionData2 } }, Domain::Piping);
 Placement
 std::vector<UniqueID> routeIds;
 routeIds.reserve (placementData.size ());
 ACAPI::Result<RoutingElementDefault> routingElementDefault = CreateRoutingElementDefault (domain);
 if (routingElementDefault.IsErr ())
 return { routingElementDefault.UnwrapErr (), ACAPI_GetToken () };
 for (const auto& data : placementData) {
 // Optionally, you could provide a GUID for the placed route with a third parameter
 ACAPI::Result<UniqueID> routingElemId = routingElementDefault->Place (data.first, data.second);
 if (routingElemId.IsErr ())
 return { routingElemId.UnwrapErr (), ACAPI_GetToken () };
 routeIds.emplace_back (*routingElemId);
 }
 return Ok (std::move (routeIds));
Constructor & Destructor Documentation
◆ RoutingElementDefault()
 ACAPI::MEP::v1::RoutingElementDefault::RoutingElementDefault  |  ( |  std::shared_ptr< Impl::IRoutingElementDefaultImpl >  |   | )
protected
Member Function Documentation
◆ Create()
 static Result< RoutingElementDefault > ACAPI::MEP::v1::RoutingElementDefault::Create  |  ( |  const API_Token &  |  ,
|  Domain
)
staticprotected
◆ GetDomain()
 Domain ACAPI::MEP::v1::RoutingElementDefault::GetDomain  |  ( |   | ) |   const
Retrieves the domain of the RoutingElementDefault.
◆ GetMEPSystem()
 API_AttributeIndex ACAPI::MEP::v1::RoutingElementDefault::GetMEPSystem  |  ( |   | ) |   const
Returns the MEPSystem attribute of the RoutingElementDefault.
◆ GetRoutingNodeDefault()
 RoutingNodeDefault ACAPI::MEP::v1::RoutingElementDefault::GetRoutingNodeDefault  |  ( |   | ) |   const
Returns
Returns the RoutingNodeDefault of the RoutingElementDefault.
◆ GetRoutingSegmentDefault()
 RoutingSegmentDefault ACAPI::MEP::v1::RoutingElementDefault::GetRoutingSegmentDefault  |  ( |   | ) |   const
Returns
Returns the RoutingSegmentDefault of the RoutingElementDefault.
◆ Modify()
 template<class ModifierFunc >
 Result< void > ACAPI::MEP::v1::RoutingElementDefault::Modify  |  ( |  ModifierFunc &&  |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ Place()
 Result< UniqueID > ACAPI::MEP::v1::RoutingElementDefault::Place  |  ( |  const std::vector< API_Coord3D > &  |  nodeCoordinates,
|  const std::vector< RoutingSegmentCrossSectionData > &  |  crossSectionData,
|  const std::optional< API_Guid > &  |  requiredId = std::nullopt
) |   |  const
Places a Routing element based on the Default.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several routes and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created route and/or MEP element, therefore the performance should be improved.
Parameters
nodeCoordinates | List of coordinates for the corner points of RoutingElement.
crossSectionData | List of data for the cross sections of the RoutingSegments.
requiredId | The guid to be set for the RoutingElement - optional parameter
Returns
If executed with success, returns the newly placed RoutingElement's uniqueId, otherwise Error.
◆ SetMEPSystem()
 Result< void > ACAPI::MEP::v1::RoutingElementDefault::SetMEPSystem  |  ( |  const API_AttributeIndex &  |  attributeIndex | )
Sets the MEPSystem attribute of RoutingElement.
Parameters
attributeIndex | The MEPSystem AttributeIndex to be set.
◆ SetRoutingNodeDefault()
 void ACAPI::MEP::v1::RoutingElementDefault::SetRoutingNodeDefault  |  ( |  const RoutingNodeDefault &  |  routingNodeDefault | )
Sets the RoutingNodeDefault of RoutingElement.
Parameters
routingNodeDefault | The default to be set.
◆ SetRoutingSegmentDefault()
 void ACAPI::MEP::v1::RoutingElementDefault::SetRoutingSegmentDefault  |  ( |  const RoutingSegmentDefault &  |  routingSegmentDefault | )
Sets the RoutingSegmentDefault of RoutingElement.
Parameters
routingSegmentDefault | The default to be set.
Friends And Related Symbol Documentation
◆ CreateRoutingElementDefault
 Result< RoutingElementDefault > CreateRoutingElementDefault  |  ( |  Domain  |  domain | )
friend
Creates a RoutingElementDefault.
Parameters
domain | The Domain of the requested RoutingElementDefault.
Returns
If able, returns a copy of Archicad's current Default of the Routing tool for the domain defined by the parameter, otherwise Error.
◆ RoutingElement
 friend class RoutingElement
friend
Member Data Documentation
◆ RoutingElementDefault
 friend ACAPI::MEP::v1::RoutingElementDefault::RoutingElementDefault